## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.group will be created
  + resource "azurerm_resource_group" "group" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "test-rg"
    }

  # azurerm_subnet.snet will be created
  + resource "azurerm_subnet" "snet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "example-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "test-rg"
      + service_endpoints                              = [
          + "Microsoft.EventHub",
        ]
      + virtual_network_name                           = "example-vnet"
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "example-vnet"
      + resource_group_name = "test-rg"
      + subnet              = (known after apply)
    }

  # module.cosmosdb.azurerm_advanced_threat_protection.this[0] will be created
  + resource "azurerm_advanced_threat_protection" "this" {
      + enabled            = true
      + id                 = (known after apply)
      + target_resource_id = (known after apply)
    }

  # module.cosmosdb.azurerm_cosmosdb_account.db will be created
  + resource "azurerm_cosmosdb_account" "db" {
      + access_key_metadata_writes_enabled       = false
      + analytical_storage_enabled               = false
      + connection_strings                       = (sensitive value)
      + create_mode                              = (known after apply)
      + default_identity_type                    = (known after apply)
      + enable_automatic_failover                = true
      + enable_free_tier                         = false
      + enable_multiple_write_locations          = true
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + ip_range_filter                          = "103.59.72.25"
      + is_virtual_network_filter_enabled        = true
      + kind                                     = "GlobalDocumentDB"
      + local_authentication_disabled            = true
      + location                                 = "westeurope"
      + mongo_server_version                     = (known after apply)
      + name                                     = "cosmos-primary-db"
      + network_acl_bypass_for_azure_services    = false
      + offer_type                               = "Standard"
      + primary_key                              = (sensitive value)
      + primary_readonly_key                     = (sensitive value)
      + primary_readonly_sql_connection_string   = (sensitive value)
      + primary_sql_connection_string            = (sensitive value)
      + public_network_access_enabled            = false
      + read_endpoints                           = (known after apply)
      + resource_group_name                      = "test-rg"
      + secondary_key                            = (sensitive value)
      + secondary_readonly_key                   = (sensitive value)
      + secondary_readonly_sql_connection_string = (sensitive value)
      + secondary_sql_connection_string          = (sensitive value)
      + write_endpoints                          = (known after apply)

      + analytical_storage {
          + schema_type = (known after apply)
        }

      + backup {
          + interval_in_minutes = 240
          + retention_in_hours  = 10
          + storage_redundancy  = (known after apply)
          + type                = "Periodic"
        }

      + capabilities {
          + name = (known after apply)
        }

      + capacity {
          + total_throughput_limit = (known after apply)
        }

      + consistency_policy {
          + consistency_level       = "BoundedStaleness"
          + max_interval_in_seconds = 300
          + max_staleness_prefix    = 100001
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "eastus"
          + zone_redundant    = true
        }
      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = "westus"
          + zone_redundant    = false
        }

      + virtual_network_rule {
          + id                                   = (known after apply)
          + ignore_missing_vnet_service_endpoint = false
        }
    }

  # module.cosmosdb.module.naming.random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.cosmosdb.module.naming.random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.cosmosdb.module.role_assignment.azurerm_role_assignment.role_assignment[0] will be created
  + resource "azurerm_role_assignment" "role_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7e661c36-f688-424a-9e3c-e53469a0299f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DocumentDB Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cosmosdb.module.role_assignment.azurerm_role_assignment.role_assignment[1] will be created
  + resource "azurerm_role_assignment" "role_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7e661c36-f688-424a-9e3c-e53469a0299f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Cosmos DB Operator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```
</details>